Revit 2027 API
ParameterTypeId.RbsRoutingPreferenceParam Property
 "Routing Preferences"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RbsRoutingPreferenceParam { get; }
Public Shared ReadOnly Property RbsRoutingPreferenceParam As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RbsRoutingPreferenceParam {
	ForgeTypeId^ get ();
}
static member RbsRoutingPreferenceParam : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace